app/controllers/products_controller.rb

SELECT COUNT(*) FROM "ratings" WHERE "ratings"."product_id" = ?  [["product_id", 1]]
---
  def show
    @ratings = Rating.product_rating(@product.id)
    length = @ratings.count

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ? AND "ratings"."product_id" = ? LIMIT ?  [["user_id", 1], ["product_id", 1], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = ?  [["product_id", 1]]
UPDATE "ratings" SET "rating" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["rating", 1], ["updated_at", "2018-10-02 13:11:18.884390"], ["id", 2]]
---
  def rating
    check_login_demo

    update = Rating.find_by(user_id: params[:user_id],
      product_id: params[:id])

    if update.blank?
      Rating.create!(user_id: update.user_id,
       product_id: update.product_id, rating: params[:point])
    else
      update.update_attributes(rating: params[:point])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def load_product
    @product = Product.find_by(id: params[:id])