app/controllers/static_pages_controller.rb

  def home
    @hot = Product.all.take(12)
---
SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 12]]