app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "phone", "address", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes user_params
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$qk9LQpCIaq1VA8DkhUbYF.LLKhk6Qy3Yl8/nYIIHhPAa3R920IFGW"], ["updated_at", "2018-09-29 10:53:26.851030"], ["id", 1]]

  def load_user
    @user = User.find_by id: params[:id]
    return unless @user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]